RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_dac.h
/* DAC output channel definitions */
#define DAC_OUT0                          ((uint8_t)0x00U)                     /*!< DACx_OUT0 channel */
#define DAC_OUT1                          ((uint8_t)0x01U)                     /*!< DACx_OUT1 channel */

/* DAC interrupt */
#define DAC_INT_DDUDR0                    DAC_CTL0_DDUDRIE0                    /*!< DACx_OUT0 DMA underrun interrupt enable */
#define DAC_INT_DDUDR1                    DAC_CTL0_DDUDRIE1                    /*!< DACx_OUT1 DMA underrun interrupt enable */

/* DAC interrupt flag */
#define DAC_INT_FLAG_DDUDR0               DAC_STAT0_DDUDR0                     /*!< DACx_OUT0 DMA underrun interrupt flag */
#define DAC_INT_FLAG_DDUDR1               DAC_STAT0_DDUDR1                     /*!< DACx_OUT1 DMA underrun interrupt flag */

/* DAC flags */
#define DAC_FLAG_DDUDR0                   DAC_STAT0_DDUDR0                     /*!< DACx_OUT0 DMA underrun flag */
#define DAC_FLAG_CALF0                    DAC_STAT0_CALF0                      /*!< DACx_OUT0 calibration offset flag */
#define DAC_FLAG_BWT0                     DAC_STAT0_BWT0                       /*!< DACx_OUT0 sample and keep wtire enable flag */
#define DAC_FLAG_DDUDR1                   DAC_STAT0_DDUDR1                     /*!< DACx_OUT1 DMA underrun flag */
#define DAC_FLAG_CALF1                    DAC_STAT0_CALF1                      /*!< DACx_OUT1 calibration offset flag */
#define DAC_FLAG_BWT1                     DAC_STAT0_BWT1                       /*!< DACx_OUT1 sample and keep wtire enable flag */

#define NOT_DAC_PERIPH(dac_periph)           (((dac_periph) != DAC0))
#define NOT_DAC_OUT(dac_out)           (((dac_out) != DAC_OUT0) && ((dac_out) != DAC_OUT1))
#define NOT_DAC_MODE(mode)           (((mode) != NORMAL_PIN_BUFFON)             && ((mode) != NORMAL_PIN_PERIPH_BUFFON) && \
                                              ((mode) != NORMAL_PIN_BUFFOFF)            && ((mode) != NORMAL_PERIPH_BUFFOFF) && \
                                              ((mode) != SAMPLEKEEP_PIN_BUFFON)         && ((mode) != SAMPLEKEEP_PIN_PERIPH_BUFFON) && \
                                              ((mode) != SAMPLEKEEP_PIN_BUFFOFF)        && ((mode) != SAMPLEKEEP_PERIPH_BUFFOFF))
                                              
/* check the counter value */
#define DAC_TRIM_HIGH_VALUE                       ((uint32_t)0x0000001FU)        /*!< maximum psc value */
#define NOT_DAC_TRIM_VALUE(trim_value)            (DAC_TRIM_HIGH_VALUE < (trim_value))

#define NOT_DAC_ALIGN(dac_align)           (((dac_align) != DAC_ALIGN_12B_R) && ((dac_align) != DAC_ALIGN_12B_L) && \
                                              ((dac_align) != DAC_ALIGN_8B_R))

#define NOT_DAC_TRIGGER(triggersource)           (((triggersource) != DAC_TRIGGER_EXTERNAL) && ((triggersource) != DAC_TRIGGER_SOFTWARE))
#define NOT_DAC_WAVE_MODE(wave_mode)           (((wave_mode) != DAC_WAVE_DISABLE)       && ((wave_mode) != DAC_WAVE_MODE_LFSR) && \
                                              ((wave_mode) != DAC_WAVE_MODE_TRIANGLE))
#define NOT_DAC_UNMASK_BITS(unmask_bits)           (((unmask_bits) != DAC_LFSR_BIT0)     && ((unmask_bits) != DAC_LFSR_BITS1_0) && \
                                              ((unmask_bits) != DAC_LFSR_BITS2_0)  && ((unmask_bits) != DAC_LFSR_BITS3_0) && \
                                              ((unmask_bits) != DAC_LFSR_BITS4_0)  && ((unmask_bits) != DAC_LFSR_BITS5_0) && \
                                              ((unmask_bits) != DAC_LFSR_BITS6_0)  && ((unmask_bits) != DAC_LFSR_BITS7_0) && \
                                              ((unmask_bits) != DAC_LFSR_BITS8_0)  && ((unmask_bits) != DAC_LFSR_BITS9_0) && \
                                              ((unmask_bits) != DAC_LFSR_BITS10_0) && ((unmask_bits) != DAC_LFSR_BITS11_0))
#define NOT_DAC_TRIANGLE_AMPLITUDE(amplitude)           (((amplitude) != DAC_TRIANGLE_AMPLITUDE_1)    && ((amplitude) != DAC_TRIANGLE_AMPLITUDE_3) && \
                                              ((amplitude) != DAC_TRIANGLE_AMPLITUDE_7)    && ((amplitude) != DAC_TRIANGLE_AMPLITUDE_15) && \
                                              ((amplitude) != DAC_TRIANGLE_AMPLITUDE_31)   && ((amplitude) != DAC_TRIANGLE_AMPLITUDE_63) && \
                                              ((amplitude) != DAC_TRIANGLE_AMPLITUDE_127)  && ((amplitude) != DAC_TRIANGLE_AMPLITUDE_255) && \
                                              ((amplitude) != DAC_TRIANGLE_AMPLITUDE_511)  && ((amplitude) != DAC_TRIANGLE_AMPLITUDE_1023) && \
                                              ((amplitude) != DAC_TRIANGLE_AMPLITUDE_2047) && ((amplitude) != DAC_TRIANGLE_AMPLITUDE_4095))
                                              
#define DAC_SAMPLE_TIME_HIGH_VALUE                       ((uint32_t)0x000001FFU)        /*!< maximum psc value */
#define NOT_DAC_SAMPLE_TIME_VALUE(sample_time)            (DAC_SAMPLE_TIME_HIGH_VALUE < (sample_time))

#define DAC_KEEP_TIME_HIGH_VALUE                       ((uint32_t)0x000001FFU)        /*!< maximum psc value */
#define NOT_DAC_KEEP_TIME_VALUE(keep_time)            (DAC_KEEP_TIME_HIGH_VALUE < (keep_time))

#define DAC_REFRESH_TIME_HIGH_VALUE                       ((uint32_t)0x000000FFU)        /*!< maximum psc value */
#define NOT_DAC_REFRESH_TIME_VALUE(refresh_time)            (DAC_REFRESH_TIME_HIGH_VALUE < (refresh_time))

#define NOT_DAC_FLAG(flag)           (((flag) != DAC_FLAG_DDUDR0) && ((flag) != DAC_FLAG_CALF0) && \
                                              ((flag) != DAC_FLAG_BWT0)   && ((flag) != DAC_FLAG_DDUDR1) && \
                                              ((flag) != DAC_FLAG_CALF1)  && ((flag) != DAC_FLAG_BWT1))
#define NOT_DAC_INTERRUPT(interrupt)           (((interrupt) != DAC_INT_DDUDR0) && ((interrupt) != DAC_INT_DDUDR1))

#define NOT_DAC_INT_FLAG(int_flag)           (((int_flag) != DAC_INT_FLAG_DDUDR0) && ((int_flag) != DAC_INT_FLAG_DDUDR1))

/* function declarations */
/* DAC initialization functions */
/* deinitialize DAC */
void dac_deinit(uint32_t dac_periph);
/* enable DAC */
void dac_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC */
void dac_disable(uint32_t dac_periph, uint8_t dac_out);
/* enable DAC DMA function */
void dac_dma_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC DMA function */
void dac_dma_disable(uint32_t dac_periph, uint8_t dac_out);

/* DAC buffer functions */
/* configure DAC mode */
void dac_mode_config(uint32_t dac_periph, uint32_t dac_out, uint32_t mode);
/* get the DACx trimming value */
uint32_t dac_trimming_value_get(uint32_t dac_periph, uint32_t dac_out);
/* set the DACx trimming value */
void dac_trimming_value_set(uint32_t dac_periph, uint32_t dac_out, uint32_t trim_value);
/* enable the DACx trimming */
void dac_trimming_enable(uint32_t dac_periph, uint32_t dac_out);

/* read and write operation functions */
/* get DAC output value */
uint16_t dac_output_value_get(uint32_t dac_periph, uint8_t dac_out);
/* set DAC data holding register value */
void dac_data_set(uint32_t dac_periph, uint8_t dac_out, uint32_t dac_align, uint16_t data);

/* DAC trigger configuration */
/* enable DAC trigger */
void dac_trigger_enable(uint32_t dac_periph, uint8_t dac_out);
/* disable DAC trigger */
void dac_trigger_disable(uint32_t dac_periph, uint8_t dac_out);
/* configure DAC trigger source */
void dac_trigger_source_config(uint32_t dac_periph, uint8_t dac_out, uint32_t triggersource);
/* enable DAC software trigger */
void dac_software_trigger_enable(uint32_t dac_periph, uint8_t dac_out);

/* DAC wave mode configuration */
/* configure DAC wave mode */
void dac_wave_mode_config(uint32_t dac_periph, uint8_t dac_out, uint32_t wave_mode);
/* configure DAC LFSR noise mode */
void dac_lfsr_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t unmask_bits);
/* configure DAC triangle noise mode */
void dac_triangle_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t amplitude);

/* DAC concurrent mode configuration */
/* enable DAC concurrent mode */
void dac_concurrent_enable(uint32_t dac_periph);
/* disable DAC concurrent mode */
void dac_concurrent_disable(uint32_t dac_periph);
/* enable DAC concurrent software trigger */
void dac_concurrent_software_trigger_enable(uint32_t dac_periph);
/* set DAC concurrent mode data holding register value */
void dac_concurrent_data_set(uint32_t dac_periph, uint32_t dac_align, uint16_t data0, uint16_t data1);

/* DAC sample and keep functions */
/* DAC sample and keep mode config */
void dac_sample_keep_mode_config(uint32_t dac_periph, uint32_t dac_out, uint32_t sample_time, uint32_t keep_time, uint32_t refresh_time);

/* DAC interrupt and flag functions */
/* get DAC flag */
FlagStatus dac_flag_get(uint32_t dac_periph, uint32_t flag);
/* clear DAC flag */
void dac_flag_clear(uint32_t dac_periph, uint32_t flag);
/* enable DAC interrupt */
void dac_interrupt_enable(uint32_t dac_periph, uint32_t interrupt);
/* disable DAC interrupt */
void dac_interrupt_disable(uint32_t dac_periph, uint32_t interrupt);
/* get DAC interrupt flag */
FlagStatus dac_interrupt_flag_get(uint32_t dac_periph, uint32_t int_flag);
/* clear DAC interrupt flag */
void dac_interrupt_flag_clear(uint32_t dac_periph, uint32_t int_flag);

#endif /* GD32H75E_DAC_H */
